app/Http/Livewire/StoreHeader.php

  public function getCartProperty()
  {
    return Cart::select('id', 'quantity_amount')
      ->where('session_id', $this->session_id)
      ->where('status_id', '!=', app('global_cart_closed'))
      ->latest()
      ->first() ?? null;
---
select `id`, `quantity_amount` from `carts` where `session_id` = 'Cvm5hpPgDO2ZKLfe76XCMJvAzbNgf38oIJ7Iso9d' and `status_id` != 29 order by `created_at` desc limit 1

  public function getCategoriesProperty()
  {
    if (app()->has('global_cache_data') && app('global_cache_data') === 'true') {

      return app()->make('cached_categories')->where('store_tab', 1)
        ->where('has_parent', 0)->sortBy('sequence')->take(app('global_limit_category'));
    } else {
      return Category::select('id', 'name', 'seo_id', 'sequence')
        ->with([
          'media' => function ($query) {
            $query->where('type', 'min')->select('media_id', 'path', 'name', 'type');
          },
          'subcategory' => function ($query) {
            $query->whereHas('category', function ($query) {
              $this->applyCategoryConditions($query);
            })->with([
              'category' => function ($query) {
                $query->select('id', 'name', 'seo_id', 'sequence');
                $this->applyCategoryConditions($query);
                $query->with([
                  'media' => function ($query) {
                    $query->where('type', 'min')->select('media_id', 'path', 'name', 'type');
                  },
                  'subcategory' => function ($query) {
                    $query->whereHas('category', function ($query) {
                      $this->applyCategoryConditions($query);
                    })->with([
                      'category' => function ($query) {
                        $query->select('id', 'name', 'seo_id', 'sequence');
                        $this->applyCategoryConditions($query);
                        $query->with([
                          'media' => function ($query) {
                            $query->where('type', 'min')->select('media_id', 'path', 'name', 'type');
                          }
                        ]);
                      }
                    ]);
                  }
                ]);
              }
            ]);
          }
        ])
        ->where('active', 1)
        ->where('store_tab', 1)
        ->where('has_parent', 0)
        ->where('start_date', '<=', now()->format('Y-m-d'))
        ->where('end_date', '>=', now()->format('Y-m-d'))
        ->orderBy('sequence')
        ->limit(app('global_limit_category'))
        ->get();
---
select `id`, `name`, `seo_id`, `sequence` from `categories` where `active` = 1 and `store_tab` = 1 and `has_parent` = 0 and `start_date` <= '2024-12-09' and `end_date` >= '2024-12-09' order by `sequence` asc limit 7