app/Http/Livewire/StoreMain.php

  public function getNewProductsProperty()
  {
    if (app()->has('global_cache_data') && app('global_cache_data') === 'true') {

      return app()->make('cached_products')
        ->filter(function ($product) {
          return $product->type != 'parent' && $product->is_new == true;
        })
        ->sortByDesc('popularity')
        ->sortByDesc('innerid')
        ->take(app('global_limit_slideritems'));
    } else {
      return Product::with([
        'media' => function ($query) {
          $query->select('path', 'name', 'type')->where('type', 'main');
        },
        'reviews' => function ($query) {
          $query->select('product_id', 'count', "value");
        },
        'product_prices' => function ($query) {
          $query->select('product_id', "value", 'discount', 'value_no_discount');
        },
        'product_categories' => function ($query) {
          $query->select('product_id', 'category_id', 'primary_category')
            ->where('primary_category', true);
          $query->with(['category' => function ($query) {
            $query->select('id', 'short_description', 'seo_id');
          }]);
        }

      ])
        ->select('id', 'end_date', 'innerid', 'name', 'seo_id', 'ean', 'quantity', 'sku', 'long_description', 'short_description', 'popularity')
        ->where('active', true)
        ->where('type', '!=', 'parent')
---
select `id`, `end_date`, `innerid`, `name`, `seo_id`, `ean`, `quantity`, `sku`, `long_description`, `brand`, `type`, `short_description`, `popularity` from `products` where `active` = 1 and `type` != 'parent' and `start_date` <= '2024-12-09' and `end_date` >= '2024-12-09' order by `popularity` desc, `innerid` asc limit 10